MikroElektronika/core_packages/PIC/XC8/def/PIC18F4682/mcu.h
// Register: TXBIE
#define TXBIE TXBIE
extern volatile unsigned char           TXBIE               __at(0xDFC);
#ifndef _LIB_BUILD
asm("TXBIE equ 0DFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned TXB0IE                 :1;
        unsigned TXB1IE                 :1;
        unsigned TXB2IE                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned TX0IE                  :1;
        unsigned TX1IE                  :1;
        unsigned TX2IE                  :1;
    };
} TXBIEbits_t;
extern volatile TXBIEbits_t TXBIEbits __at(0xDFC);
// bitfield macros
#define _TXBIE_TXB0IE_POSN                                  0x2
#define _TXBIE_TXB0IE_POSITION                              0x2
#define _TXBIE_TXB0IE_SIZE                                  0x1
#define _TXBIE_TXB0IE_LENGTH                                0x1
#define _TXBIE_TXB0IE_MASK                                  0x4
#define _TXBIE_TXB1IE_POSN                                  0x3
#define _TXBIE_TXB1IE_POSITION                              0x3
#define _TXBIE_TXB1IE_SIZE                                  0x1
#define _TXBIE_TXB1IE_LENGTH                                0x1
#define _TXBIE_TXB1IE_MASK                                  0x8
#define _TXBIE_TXB2IE_POSN                                  0x4
#define _TXBIE_TXB2IE_POSITION                              0x4
#define _TXBIE_TXB2IE_SIZE                                  0x1
#define _TXBIE_TXB2IE_LENGTH                                0x1
#define _TXBIE_TXB2IE_MASK                                  0x10
#define _TXBIE_TX0IE_POSN                                   0x2
#define _TXBIE_TX0IE_POSITION                               0x2
#define _TXBIE_TX0IE_SIZE                                   0x1
#define _TXBIE_TX0IE_LENGTH                                 0x1
#define _TXBIE_TX0IE_MASK                                   0x4
#define _TXBIE_TX1IE_POSN                                   0x3
#define _TXBIE_TX1IE_POSITION                               0x3
#define _TXBIE_TX1IE_SIZE                                   0x1
#define _TXBIE_TX1IE_LENGTH                                 0x1
#define _TXBIE_TX1IE_MASK                                   0x8
#define _TXBIE_TX2IE_POSN                                   0x4
#define _TXBIE_TX2IE_POSITION                               0x4
#define _TXBIE_TX2IE_SIZE                                   0x1
#define _TXBIE_TX2IE_LENGTH                                 0x1
#define _TXBIE_TX2IE_MASK                                   0x10

// Register: B0CON
#define B0CON B0CON
extern volatile unsigned char           B0CON               __at(0xE20);
#ifndef _LIB_BUILD
asm("B0CON equ 0E20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0_TXPRI0         :1;
        unsigned FILHIT1_TXPRI1         :1;
        unsigned FILHIT2_RTREN          :1;
        unsigned FILHIT3_TXREQ          :1;
        unsigned FILHIT4_TXERR          :1;
        unsigned RXRTRRO_TXLARB         :1;
        unsigned RXM1_TXABT             :1;
        unsigned RXFUL_TXBIF            :1;
    };
    struct {
        unsigned FILHIT0                :1;
        unsigned FILHIT1                :1;
        unsigned FILHIT2                :1;
        unsigned FILHIT3                :1;
        unsigned FILHIT4                :1;
        unsigned RTRRO                  :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned RTREN                  :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
        unsigned TXBIF                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned RXRTRRO                :1;
    };
    struct {
        unsigned B0FILHIT0              :1;
        unsigned B0FILHIT1              :1;
        unsigned B0FILHIT2              :1;
        unsigned B0FILHIT3              :1;
        unsigned B0FILHIT4              :1;
        unsigned B0RTRRO                :1;
        unsigned B0RXM1                 :1;
        unsigned B0RXFUL                :1;
    };
    struct {
        unsigned B0TXPRI0               :1;
        unsigned B0TXPRI1               :1;
        unsigned B0RTREN                :1;
        unsigned B0TXREQ                :1;
        unsigned B0TXERR                :1;
        unsigned B0TXLARB               :1;
        unsigned B0TXABT                :1;
        unsigned B0TXB3IF               :1;
    };
} B0CONbits_t;
extern volatile B0CONbits_t B0CONbits __at(0xE20);
// bitfield macros
#define _B0CON_FILHIT0_TXPRI0_POSN                          0x0
#define _B0CON_FILHIT0_TXPRI0_POSITION                      0x0
#define _B0CON_FILHIT0_TXPRI0_SIZE                          0x1
#define _B0CON_FILHIT0_TXPRI0_LENGTH                        0x1
#define _B0CON_FILHIT0_TXPRI0_MASK                          0x1
#define _B0CON_FILHIT1_TXPRI1_POSN                          0x1
#define _B0CON_FILHIT1_TXPRI1_POSITION                      0x1
#define _B0CON_FILHIT1_TXPRI1_SIZE                          0x1
#define _B0CON_FILHIT1_TXPRI1_LENGTH                        0x1
#define _B0CON_FILHIT1_TXPRI1_MASK                          0x2
#define _B0CON_FILHIT2_RTREN_POSN                           0x2
#define _B0CON_FILHIT2_RTREN_POSITION                       0x2
#define _B0CON_FILHIT2_RTREN_SIZE                           0x1
#define _B0CON_FILHIT2_RTREN_LENGTH                         0x1
#define _B0CON_FILHIT2_RTREN_MASK                           0x4
#define _B0CON_FILHIT3_TXREQ_POSN                           0x3
#define _B0CON_FILHIT3_TXREQ_POSITION                       0x3
#define _B0CON_FILHIT3_TXREQ_SIZE                           0x1
#define _B0CON_FILHIT3_TXREQ_LENGTH                         0x1
#define _B0CON_FILHIT3_TXREQ_MASK                           0x8
#define _B0CON_FILHIT4_TXERR_POSN                           0x4
#define _B0CON_FILHIT4_TXERR_POSITION                       0x4
#define _B0CON_FILHIT4_TXERR_SIZE                           0x1
#define _B0CON_FILHIT4_TXERR_LENGTH                         0x1
#define _B0CON_FILHIT4_TXERR_MASK                           0x10
#define _B0CON_RXRTRRO_TXLARB_POSN                          0x5
#define _B0CON_RXRTRRO_TXLARB_POSITION                      0x5
#define _B0CON_RXRTRRO_TXLARB_SIZE                          0x1
#define _B0CON_RXRTRRO_TXLARB_LENGTH                        0x1
#define _B0CON_RXRTRRO_TXLARB_MASK                          0x20
#define _B0CON_RXM1_TXABT_POSN                              0x6
#define _B0CON_RXM1_TXABT_POSITION                          0x6
#define _B0CON_RXM1_TXABT_SIZE                              0x1
#define _B0CON_RXM1_TXABT_LENGTH                            0x1
#define _B0CON_RXM1_TXABT_MASK                              0x40
#define _B0CON_RXFUL_TXBIF_POSN                             0x7
#define _B0CON_RXFUL_TXBIF_POSITION                         0x7
#define _B0CON_RXFUL_TXBIF_SIZE                             0x1
#define _B0CON_RXFUL_TXBIF_LENGTH                           0x1
#define _B0CON_RXFUL_TXBIF_MASK                             0x80
#define _B0CON_FILHIT0_POSN                                 0x0
#define _B0CON_FILHIT0_POSITION                             0x0
#define _B0CON_FILHIT0_SIZE                                 0x1
#define _B0CON_FILHIT0_LENGTH                               0x1
#define _B0CON_FILHIT0_MASK                                 0x1
#define _B0CON_FILHIT1_POSN                                 0x1
#define _B0CON_FILHIT1_POSITION                             0x1
#define _B0CON_FILHIT1_SIZE                                 0x1
#define _B0CON_FILHIT1_LENGTH                               0x1
#define _B0CON_FILHIT1_MASK                                 0x2
#define _B0CON_FILHIT2_POSN                                 0x2
#define _B0CON_FILHIT2_POSITION                             0x2
#define _B0CON_FILHIT2_SIZE                                 0x1
#define _B0CON_FILHIT2_LENGTH                               0x1
#define _B0CON_FILHIT2_MASK                                 0x4
#define _B0CON_FILHIT3_POSN                                 0x3
#define _B0CON_FILHIT3_POSITION                             0x3
#define _B0CON_FILHIT3_SIZE                                 0x1
#define _B0CON_FILHIT3_LENGTH                               0x1
#define _B0CON_FILHIT3_MASK                                 0x8
#define _B0CON_FILHIT4_POSN                                 0x4
#define _B0CON_FILHIT4_POSITION                             0x4
#define _B0CON_FILHIT4_SIZE                                 0x1
#define _B0CON_FILHIT4_LENGTH                               0x1
#define _B0CON_FILHIT4_MASK                                 0x10
#define _B0CON_RTRRO_POSN                                   0x5
#define _B0CON_RTRRO_POSITION                               0x5
#define _B0CON_RTRRO_SIZE                                   0x1
#define _B0CON_RTRRO_LENGTH                                 0x1
#define _B0CON_RTRRO_MASK                                   0x20
#define _B0CON_RXM1_POSN                                    0x6
#define _B0CON_RXM1_POSITION                                0x6
#define _B0CON_RXM1_SIZE                                    0x1
#define _B0CON_RXM1_LENGTH                                  0x1
#define _B0CON_RXM1_MASK                                    0x40
#define _B0CON_RXFUL_POSN                                   0x7
#define _B0CON_RXFUL_POSITION                               0x7
#define _B0CON_RXFUL_SIZE                                   0x1
#define _B0CON_RXFUL_LENGTH                                 0x1
#define _B0CON_RXFUL_MASK                                   0x80
#define _B0CON_TXPRI0_POSN                                  0x0
#define _B0CON_TXPRI0_POSITION                              0x0
#define _B0CON_TXPRI0_SIZE                                  0x1
#define _B0CON_TXPRI0_LENGTH                                0x1
#define _B0CON_TXPRI0_MASK                                  0x1
#define _B0CON_TXPRI1_POSN                                  0x1
#define _B0CON_TXPRI1_POSITION                              0x1
#define _B0CON_TXPRI1_SIZE                                  0x1
#define _B0CON_TXPRI1_LENGTH                                0x1
#define _B0CON_TXPRI1_MASK                                  0x2
#define _B0CON_RTREN_POSN                                   0x2
#define _B0CON_RTREN_POSITION                               0x2
#define _B0CON_RTREN_SIZE                                   0x1
#define _B0CON_RTREN_LENGTH                                 0x1
#define _B0CON_RTREN_MASK                                   0x4
#define _B0CON_TXREQ_POSN                                   0x3
#define _B0CON_TXREQ_POSITION                               0x3
#define _B0CON_TXREQ_SIZE                                   0x1
#define _B0CON_TXREQ_LENGTH                                 0x1
#define _B0CON_TXREQ_MASK                                   0x8
#define _B0CON_TXERR_POSN                                   0x4
#define _B0CON_TXERR_POSITION                               0x4
#define _B0CON_TXERR_SIZE                                   0x1
#define _B0CON_TXERR_LENGTH                                 0x1
#define _B0CON_TXERR_MASK                                   0x10
#define _B0CON_TXLARB_POSN                                  0x5
#define _B0CON_TXLARB_POSITION                              0x5
#define _B0CON_TXLARB_SIZE                                  0x1
#define _B0CON_TXLARB_LENGTH                                0x1
#define _B0CON_TXLARB_MASK                                  0x20
#define _B0CON_TXABT_POSN                                   0x6
#define _B0CON_TXABT_POSITION                               0x6
#define _B0CON_TXABT_SIZE                                   0x1
#define _B0CON_TXABT_LENGTH                                 0x1
#define _B0CON_TXABT_MASK                                   0x40
#define _B0CON_TXBIF_POSN                                   0x7
#define _B0CON_TXBIF_POSITION                               0x7
#define _B0CON_TXBIF_SIZE                                   0x1
#define _B0CON_TXBIF_LENGTH                                 0x1
#define _B0CON_TXBIF_MASK                                   0x80
#define _B0CON_RXRTRRO_POSN                                 0x5
#define _B0CON_RXRTRRO_POSITION                             0x5
#define _B0CON_RXRTRRO_SIZE                                 0x1
#define _B0CON_RXRTRRO_LENGTH                               0x1
#define _B0CON_RXRTRRO_MASK                                 0x20
#define _B0CON_B0FILHIT0_POSN                               0x0
#define _B0CON_B0FILHIT0_POSITION                           0x0
#define _B0CON_B0FILHIT0_SIZE                               0x1
#define _B0CON_B0FILHIT0_LENGTH                             0x1
#define _B0CON_B0FILHIT0_MASK                               0x1
#define _B0CON_B0FILHIT1_POSN                               0x1
#define _B0CON_B0FILHIT1_POSITION                           0x1
#define _B0CON_B0FILHIT1_SIZE                               0x1
#define _B0CON_B0FILHIT1_LENGTH                             0x1
#define _B0CON_B0FILHIT1_MASK                               0x2
#define _B0CON_B0FILHIT2_POSN                               0x2
#define _B0CON_B0FILHIT2_POSITION                           0x2
#define _B0CON_B0FILHIT2_SIZE                               0x1
#define _B0CON_B0FILHIT2_LENGTH                             0x1
#define _B0CON_B0FILHIT2_MASK                               0x4
#define _B0CON_B0FILHIT3_POSN                               0x3
#define _B0CON_B0FILHIT3_POSITION                           0x3
#define _B0CON_B0FILHIT3_SIZE                               0x1
#define _B0CON_B0FILHIT3_LENGTH                             0x1
#define _B0CON_B0FILHIT3_MASK                               0x8
#define _B0CON_B0FILHIT4_POSN                               0x4
#define _B0CON_B0FILHIT4_POSITION                           0x4
#define _B0CON_B0FILHIT4_SIZE                               0x1
#define _B0CON_B0FILHIT4_LENGTH                             0x1
#define _B0CON_B0FILHIT4_MASK                               0x10
#define _B0CON_B0RTRRO_POSN                                 0x5
#define _B0CON_B0RTRRO_POSITION                             0x5
#define _B0CON_B0RTRRO_SIZE                                 0x1
#define _B0CON_B0RTRRO_LENGTH                               0x1
#define _B0CON_B0RTRRO_MASK                                 0x20
#define _B0CON_B0RXM1_POSN                                  0x6
#define _B0CON_B0RXM1_POSITION                              0x6
#define _B0CON_B0RXM1_SIZE                                  0x1
#define _B0CON_B0RXM1_LENGTH                                0x1
#define _B0CON_B0RXM1_MASK                                  0x40
#define _B0CON_B0RXFUL_POSN                                 0x7
#define _B0CON_B0RXFUL_POSITION                             0x7
#define _B0CON_B0RXFUL_SIZE                                 0x1
#define _B0CON_B0RXFUL_LENGTH                               0x1
#define _B0CON_B0RXFUL_MASK                                 0x80
#define _B0CON_B0TXPRI0_POSN                                0x0
#define _B0CON_B0TXPRI0_POSITION                            0x0
#define _B0CON_B0TXPRI0_SIZE                                0x1
#define _B0CON_B0TXPRI0_LENGTH                              0x1
#define _B0CON_B0TXPRI0_MASK                                0x1
#define _B0CON_B0TXPRI1_POSN                                0x1
#define _B0CON_B0TXPRI1_POSITION                            0x1
#define _B0CON_B0TXPRI1_SIZE                                0x1
#define _B0CON_B0TXPRI1_LENGTH                              0x1
#define _B0CON_B0TXPRI1_MASK                                0x2
#define _B0CON_B0RTREN_POSN                                 0x2
#define _B0CON_B0RTREN_POSITION                             0x2
#define _B0CON_B0RTREN_SIZE                                 0x1
#define _B0CON_B0RTREN_LENGTH                               0x1
#define _B0CON_B0RTREN_MASK                                 0x4
#define _B0CON_B0TXREQ_POSN                                 0x3
#define _B0CON_B0TXREQ_POSITION                             0x3
#define _B0CON_B0TXREQ_SIZE                                 0x1
#define _B0CON_B0TXREQ_LENGTH                               0x1
#define _B0CON_B0TXREQ_MASK                                 0x8
#define _B0CON_B0TXERR_POSN                                 0x4
#define _B0CON_B0TXERR_POSITION                             0x4
#define _B0CON_B0TXERR_SIZE                                 0x1
#define _B0CON_B0TXERR_LENGTH                               0x1
#define _B0CON_B0TXERR_MASK                                 0x10
#define _B0CON_B0TXLARB_POSN                                0x5
#define _B0CON_B0TXLARB_POSITION                            0x5
#define _B0CON_B0TXLARB_SIZE                                0x1
#define _B0CON_B0TXLARB_LENGTH                              0x1
#define _B0CON_B0TXLARB_MASK                                0x20
#define _B0CON_B0TXABT_POSN                                 0x6
#define _B0CON_B0TXABT_POSITION                             0x6
#define _B0CON_B0TXABT_SIZE                                 0x1
#define _B0CON_B0TXABT_LENGTH                               0x1
#define _B0CON_B0TXABT_MASK                                 0x40
#define _B0CON_B0TXB3IF_POSN                                0x7
#define _B0CON_B0TXB3IF_POSITION                            0x7
#define _B0CON_B0TXB3IF_SIZE                                0x1
#define _B0CON_B0TXB3IF_LENGTH                              0x1
#define _B0CON_B0TXB3IF_MASK                                0x80

// Register: B0SIDH
#define B0SIDH B0SIDH
extern volatile unsigned char           B0SIDH              __at(0xE21);
#ifndef _LIB_BUILD
asm("B0SIDH equ 0E21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned B0SID3                 :1;
        unsigned B0SID4                 :1;
        unsigned B0SID5                 :1;
        unsigned B0SID6                 :1;
        unsigned B0SID7                 :1;
        unsigned B0SID8                 :1;
        unsigned B0SID9                 :1;
        unsigned B0SID10                :1;
    };
} B0SIDHbits_t;
