MikroElektronika/core_packages/PIC/XC8/def/PIC18F4682/mcu.h
extern volatile B4EIDLbits_t B4EIDLbits __at(0xE64);
// bitfield macros
#define _B4EIDL_EID0_POSN                                   0x0
#define _B4EIDL_EID0_POSITION                               0x0
#define _B4EIDL_EID0_SIZE                                   0x1
#define _B4EIDL_EID0_LENGTH                                 0x1
#define _B4EIDL_EID0_MASK                                   0x1
#define _B4EIDL_EID1_POSN                                   0x1
#define _B4EIDL_EID1_POSITION                               0x1
#define _B4EIDL_EID1_SIZE                                   0x1
#define _B4EIDL_EID1_LENGTH                                 0x1
#define _B4EIDL_EID1_MASK                                   0x2
#define _B4EIDL_EID2_POSN                                   0x2
#define _B4EIDL_EID2_POSITION                               0x2
#define _B4EIDL_EID2_SIZE                                   0x1
#define _B4EIDL_EID2_LENGTH                                 0x1
#define _B4EIDL_EID2_MASK                                   0x4
#define _B4EIDL_EID3_POSN                                   0x3
#define _B4EIDL_EID3_POSITION                               0x3
#define _B4EIDL_EID3_SIZE                                   0x1
#define _B4EIDL_EID3_LENGTH                                 0x1
#define _B4EIDL_EID3_MASK                                   0x8
#define _B4EIDL_EID4_POSN                                   0x4
#define _B4EIDL_EID4_POSITION                               0x4
#define _B4EIDL_EID4_SIZE                                   0x1
#define _B4EIDL_EID4_LENGTH                                 0x1
#define _B4EIDL_EID4_MASK                                   0x10
#define _B4EIDL_EID5_POSN                                   0x5
#define _B4EIDL_EID5_POSITION                               0x5
#define _B4EIDL_EID5_SIZE                                   0x1
#define _B4EIDL_EID5_LENGTH                                 0x1
#define _B4EIDL_EID5_MASK                                   0x20
#define _B4EIDL_EID6_POSN                                   0x6
#define _B4EIDL_EID6_POSITION                               0x6
#define _B4EIDL_EID6_SIZE                                   0x1
#define _B4EIDL_EID6_LENGTH                                 0x1
#define _B4EIDL_EID6_MASK                                   0x40
#define _B4EIDL_EID7_POSN                                   0x7
#define _B4EIDL_EID7_POSITION                               0x7
#define _B4EIDL_EID7_SIZE                                   0x1
#define _B4EIDL_EID7_LENGTH                                 0x1
#define _B4EIDL_EID7_MASK                                   0x80
#define _B4EIDL_B4EID0_POSN                                 0x0
#define _B4EIDL_B4EID0_POSITION                             0x0
#define _B4EIDL_B4EID0_SIZE                                 0x1
#define _B4EIDL_B4EID0_LENGTH                               0x1
#define _B4EIDL_B4EID0_MASK                                 0x1
#define _B4EIDL_B4EID1_POSN                                 0x1
#define _B4EIDL_B4EID1_POSITION                             0x1
#define _B4EIDL_B4EID1_SIZE                                 0x1
#define _B4EIDL_B4EID1_LENGTH                               0x1
#define _B4EIDL_B4EID1_MASK                                 0x2
#define _B4EIDL_B4EID2_POSN                                 0x2
#define _B4EIDL_B4EID2_POSITION                             0x2
#define _B4EIDL_B4EID2_SIZE                                 0x1
#define _B4EIDL_B4EID2_LENGTH                               0x1
#define _B4EIDL_B4EID2_MASK                                 0x4
#define _B4EIDL_B4EID3_POSN                                 0x3
#define _B4EIDL_B4EID3_POSITION                             0x3
#define _B4EIDL_B4EID3_SIZE                                 0x1
#define _B4EIDL_B4EID3_LENGTH                               0x1
#define _B4EIDL_B4EID3_MASK                                 0x8
#define _B4EIDL_B4EID4_POSN                                 0x4
#define _B4EIDL_B4EID4_POSITION                             0x4
#define _B4EIDL_B4EID4_SIZE                                 0x1
#define _B4EIDL_B4EID4_LENGTH                               0x1
#define _B4EIDL_B4EID4_MASK                                 0x10
#define _B4EIDL_B4EID5_POSN                                 0x5
#define _B4EIDL_B4EID5_POSITION                             0x5
#define _B4EIDL_B4EID5_SIZE                                 0x1
#define _B4EIDL_B4EID5_LENGTH                               0x1
#define _B4EIDL_B4EID5_MASK                                 0x20
#define _B4EIDL_B4EID6_POSN                                 0x6
#define _B4EIDL_B4EID6_POSITION                             0x6
#define _B4EIDL_B4EID6_SIZE                                 0x1
#define _B4EIDL_B4EID6_LENGTH                               0x1
#define _B4EIDL_B4EID6_MASK                                 0x40
#define _B4EIDL_B4EID7_POSN                                 0x7
#define _B4EIDL_B4EID7_POSITION                             0x7
#define _B4EIDL_B4EID7_SIZE                                 0x1
#define _B4EIDL_B4EID7_LENGTH                               0x1
#define _B4EIDL_B4EID7_MASK                                 0x80

// Register: B4DLC
#define B4DLC B4DLC
extern volatile unsigned char           B4DLC               __at(0xE65);
#ifndef _LIB_BUILD
asm("B4DLC equ 0E65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR_TXRTR            :1;
    };
    struct {
        unsigned                        :4;
        unsigned RESRB0                 :1;
        unsigned RESRB1                 :1;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned B4DLC0                 :1;
        unsigned B4DLC1                 :1;
        unsigned B4DLC2                 :1;
        unsigned B4DLC3                 :1;
        unsigned B4RB0                  :1;
        unsigned B4RB1                  :1;
        unsigned B4RXRTR                :1;
    };
} B4DLCbits_t;
extern volatile B4DLCbits_t B4DLCbits __at(0xE65);
// bitfield macros
#define _B4DLC_DLC0_POSN                                    0x0
#define _B4DLC_DLC0_POSITION                                0x0
#define _B4DLC_DLC0_SIZE                                    0x1
#define _B4DLC_DLC0_LENGTH                                  0x1
#define _B4DLC_DLC0_MASK                                    0x1
#define _B4DLC_DLC1_POSN                                    0x1
#define _B4DLC_DLC1_POSITION                                0x1
#define _B4DLC_DLC1_SIZE                                    0x1
#define _B4DLC_DLC1_LENGTH                                  0x1
#define _B4DLC_DLC1_MASK                                    0x2
#define _B4DLC_DLC2_POSN                                    0x2
#define _B4DLC_DLC2_POSITION                                0x2
#define _B4DLC_DLC2_SIZE                                    0x1
#define _B4DLC_DLC2_LENGTH                                  0x1
#define _B4DLC_DLC2_MASK                                    0x4
#define _B4DLC_DLC3_POSN                                    0x3
#define _B4DLC_DLC3_POSITION                                0x3
#define _B4DLC_DLC3_SIZE                                    0x1
#define _B4DLC_DLC3_LENGTH                                  0x1
#define _B4DLC_DLC3_MASK                                    0x8
#define _B4DLC_RB0_POSN                                     0x4
#define _B4DLC_RB0_POSITION                                 0x4
#define _B4DLC_RB0_SIZE                                     0x1
#define _B4DLC_RB0_LENGTH                                   0x1
#define _B4DLC_RB0_MASK                                     0x10
#define _B4DLC_RB1_POSN                                     0x5
#define _B4DLC_RB1_POSITION                                 0x5
#define _B4DLC_RB1_SIZE                                     0x1
#define _B4DLC_RB1_LENGTH                                   0x1
#define _B4DLC_RB1_MASK                                     0x20
#define _B4DLC_RXRTR_TXRTR_POSN                             0x6
#define _B4DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B4DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B4DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B4DLC_RXRTR_TXRTR_MASK                             0x40
#define _B4DLC_RESRB0_POSN                                  0x4
#define _B4DLC_RESRB0_POSITION                              0x4
#define _B4DLC_RESRB0_SIZE                                  0x1
#define _B4DLC_RESRB0_LENGTH                                0x1
#define _B4DLC_RESRB0_MASK                                  0x10
#define _B4DLC_RESRB1_POSN                                  0x5
#define _B4DLC_RESRB1_POSITION                              0x5
#define _B4DLC_RESRB1_SIZE                                  0x1
#define _B4DLC_RESRB1_LENGTH                                0x1
#define _B4DLC_RESRB1_MASK                                  0x20
#define _B4DLC_TXRTR_POSN                                   0x6
#define _B4DLC_TXRTR_POSITION                               0x6
#define _B4DLC_TXRTR_SIZE                                   0x1
#define _B4DLC_TXRTR_LENGTH                                 0x1
#define _B4DLC_TXRTR_MASK                                   0x40
#define _B4DLC_RXRTR_POSN                                   0x6
#define _B4DLC_RXRTR_POSITION                               0x6
#define _B4DLC_RXRTR_SIZE                                   0x1
#define _B4DLC_RXRTR_LENGTH                                 0x1
#define _B4DLC_RXRTR_MASK                                   0x40
#define _B4DLC_B4DLC0_POSN                                  0x0
#define _B4DLC_B4DLC0_POSITION                              0x0
#define _B4DLC_B4DLC0_SIZE                                  0x1
#define _B4DLC_B4DLC0_LENGTH                                0x1
#define _B4DLC_B4DLC0_MASK                                  0x1
#define _B4DLC_B4DLC1_POSN                                  0x1
#define _B4DLC_B4DLC1_POSITION                              0x1
#define _B4DLC_B4DLC1_SIZE                                  0x1
#define _B4DLC_B4DLC1_LENGTH                                0x1
#define _B4DLC_B4DLC1_MASK                                  0x2
#define _B4DLC_B4DLC2_POSN                                  0x2
#define _B4DLC_B4DLC2_POSITION                              0x2
#define _B4DLC_B4DLC2_SIZE                                  0x1
#define _B4DLC_B4DLC2_LENGTH                                0x1
#define _B4DLC_B4DLC2_MASK                                  0x4
#define _B4DLC_B4DLC3_POSN                                  0x3
#define _B4DLC_B4DLC3_POSITION                              0x3
#define _B4DLC_B4DLC3_SIZE                                  0x1
#define _B4DLC_B4DLC3_LENGTH                                0x1
#define _B4DLC_B4DLC3_MASK                                  0x8
#define _B4DLC_B4RB0_POSN                                   0x4
#define _B4DLC_B4RB0_POSITION                               0x4
#define _B4DLC_B4RB0_SIZE                                   0x1
#define _B4DLC_B4RB0_LENGTH                                 0x1
#define _B4DLC_B4RB0_MASK                                   0x10
#define _B4DLC_B4RB1_POSN                                   0x5
#define _B4DLC_B4RB1_POSITION                               0x5
#define _B4DLC_B4RB1_SIZE                                   0x1
#define _B4DLC_B4RB1_LENGTH                                 0x1
#define _B4DLC_B4RB1_MASK                                   0x20
#define _B4DLC_B4RXRTR_POSN                                 0x6
#define _B4DLC_B4RXRTR_POSITION                             0x6
#define _B4DLC_B4RXRTR_SIZE                                 0x1
#define _B4DLC_B4RXRTR_LENGTH                               0x1
#define _B4DLC_B4RXRTR_MASK                                 0x40

// Register: B4D0
#define B4D0 B4D0
extern volatile unsigned char           B4D0                __at(0xE66);
#ifndef _LIB_BUILD
asm("B4D0 equ 0E66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D00                  :1;
        unsigned B4D01                  :1;
        unsigned B4D02                  :1;
        unsigned B4D03                  :1;
        unsigned B4D04                  :1;
        unsigned B4D05                  :1;
        unsigned B4D06                  :1;
        unsigned B4D07                  :1;
    };
} B4D0bits_t;
extern volatile B4D0bits_t B4D0bits __at(0xE66);
// bitfield macros
#define _B4D0_B4D00_POSN                                    0x0
#define _B4D0_B4D00_POSITION                                0x0
#define _B4D0_B4D00_SIZE                                    0x1
#define _B4D0_B4D00_LENGTH                                  0x1
#define _B4D0_B4D00_MASK                                    0x1
#define _B4D0_B4D01_POSN                                    0x1
#define _B4D0_B4D01_POSITION                                0x1
#define _B4D0_B4D01_SIZE                                    0x1
#define _B4D0_B4D01_LENGTH                                  0x1
#define _B4D0_B4D01_MASK                                    0x2
#define _B4D0_B4D02_POSN                                    0x2
#define _B4D0_B4D02_POSITION                                0x2
#define _B4D0_B4D02_SIZE                                    0x1
#define _B4D0_B4D02_LENGTH                                  0x1
#define _B4D0_B4D02_MASK                                    0x4
#define _B4D0_B4D03_POSN                                    0x3
#define _B4D0_B4D03_POSITION                                0x3
#define _B4D0_B4D03_SIZE                                    0x1
#define _B4D0_B4D03_LENGTH                                  0x1
#define _B4D0_B4D03_MASK                                    0x8
#define _B4D0_B4D04_POSN                                    0x4
#define _B4D0_B4D04_POSITION                                0x4
#define _B4D0_B4D04_SIZE                                    0x1
#define _B4D0_B4D04_LENGTH                                  0x1
#define _B4D0_B4D04_MASK                                    0x10
#define _B4D0_B4D05_POSN                                    0x5
#define _B4D0_B4D05_POSITION                                0x5
#define _B4D0_B4D05_SIZE                                    0x1
#define _B4D0_B4D05_LENGTH                                  0x1
#define _B4D0_B4D05_MASK                                    0x20
#define _B4D0_B4D06_POSN                                    0x6
#define _B4D0_B4D06_POSITION                                0x6
#define _B4D0_B4D06_SIZE                                    0x1
#define _B4D0_B4D06_LENGTH                                  0x1
#define _B4D0_B4D06_MASK                                    0x40
#define _B4D0_B4D07_POSN                                    0x7
#define _B4D0_B4D07_POSITION                                0x7
#define _B4D0_B4D07_SIZE                                    0x1
#define _B4D0_B4D07_LENGTH                                  0x1
#define _B4D0_B4D07_MASK                                    0x80

// Register: B4D1
#define B4D1 B4D1
extern volatile unsigned char           B4D1                __at(0xE67);
#ifndef _LIB_BUILD
asm("B4D1 equ 0E67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D10                  :1;
        unsigned B4D11                  :1;
        unsigned B4D12                  :1;
        unsigned B4D13                  :1;
        unsigned B4D14                  :1;
        unsigned B4D15                  :1;
        unsigned B4D16                  :1;
        unsigned B4D17                  :1;
    };
} B4D1bits_t;
extern volatile B4D1bits_t B4D1bits __at(0xE67);
// bitfield macros
#define _B4D1_B4D10_POSN                                    0x0
#define _B4D1_B4D10_POSITION                                0x0
#define _B4D1_B4D10_SIZE                                    0x1
#define _B4D1_B4D10_LENGTH                                  0x1
#define _B4D1_B4D10_MASK                                    0x1
#define _B4D1_B4D11_POSN                                    0x1
#define _B4D1_B4D11_POSITION                                0x1
#define _B4D1_B4D11_SIZE                                    0x1
#define _B4D1_B4D11_LENGTH                                  0x1
#define _B4D1_B4D11_MASK                                    0x2
#define _B4D1_B4D12_POSN                                    0x2
#define _B4D1_B4D12_POSITION                                0x2
#define _B4D1_B4D12_SIZE                                    0x1
#define _B4D1_B4D12_LENGTH                                  0x1
#define _B4D1_B4D12_MASK                                    0x4
#define _B4D1_B4D13_POSN                                    0x3
#define _B4D1_B4D13_POSITION                                0x3
#define _B4D1_B4D13_SIZE                                    0x1
#define _B4D1_B4D13_LENGTH                                  0x1
#define _B4D1_B4D13_MASK                                    0x8
#define _B4D1_B4D14_POSN                                    0x4
#define _B4D1_B4D14_POSITION                                0x4
#define _B4D1_B4D14_SIZE                                    0x1
#define _B4D1_B4D14_LENGTH                                  0x1
#define _B4D1_B4D14_MASK                                    0x10
#define _B4D1_B4D15_POSN                                    0x5
#define _B4D1_B4D15_POSITION                                0x5
#define _B4D1_B4D15_SIZE                                    0x1
#define _B4D1_B4D15_LENGTH                                  0x1
#define _B4D1_B4D15_MASK                                    0x20
#define _B4D1_B4D16_POSN                                    0x6
#define _B4D1_B4D16_POSITION                                0x6
#define _B4D1_B4D16_SIZE                                    0x1
#define _B4D1_B4D16_LENGTH                                  0x1
#define _B4D1_B4D16_MASK                                    0x40
#define _B4D1_B4D17_POSN                                    0x7
#define _B4D1_B4D17_POSITION                                0x7
#define _B4D1_B4D17_SIZE                                    0x1
#define _B4D1_B4D17_LENGTH                                  0x1
#define _B4D1_B4D17_MASK                                    0x80

// Register: B4D2
#define B4D2 B4D2
extern volatile unsigned char           B4D2                __at(0xE68);
#ifndef _LIB_BUILD
asm("B4D2 equ 0E68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D20                  :1;
        unsigned B4D21                  :1;
        unsigned B4D22                  :1;
        unsigned B4D23                  :1;
        unsigned B4D24                  :1;
        unsigned B4D25                  :1;
        unsigned B4D26                  :1;
        unsigned B4D27                  :1;
    };
} B4D2bits_t;
extern volatile B4D2bits_t B4D2bits __at(0xE68);
// bitfield macros
#define _B4D2_B4D20_POSN                                    0x0
#define _B4D2_B4D20_POSITION                                0x0
#define _B4D2_B4D20_SIZE                                    0x1
#define _B4D2_B4D20_LENGTH                                  0x1
#define _B4D2_B4D20_MASK                                    0x1
#define _B4D2_B4D21_POSN                                    0x1
#define _B4D2_B4D21_POSITION                                0x1
#define _B4D2_B4D21_SIZE                                    0x1
#define _B4D2_B4D21_LENGTH                                  0x1
#define _B4D2_B4D21_MASK                                    0x2
#define _B4D2_B4D22_POSN                                    0x2
#define _B4D2_B4D22_POSITION                                0x2
#define _B4D2_B4D22_SIZE                                    0x1
#define _B4D2_B4D22_LENGTH                                  0x1
#define _B4D2_B4D22_MASK                                    0x4
#define _B4D2_B4D23_POSN                                    0x3
#define _B4D2_B4D23_POSITION                                0x3
#define _B4D2_B4D23_SIZE                                    0x1
#define _B4D2_B4D23_LENGTH                                  0x1
#define _B4D2_B4D23_MASK                                    0x8
#define _B4D2_B4D24_POSN                                    0x4
#define _B4D2_B4D24_POSITION                                0x4
#define _B4D2_B4D24_SIZE                                    0x1
#define _B4D2_B4D24_LENGTH                                  0x1
#define _B4D2_B4D24_MASK                                    0x10
#define _B4D2_B4D25_POSN                                    0x5
#define _B4D2_B4D25_POSITION                                0x5
#define _B4D2_B4D25_SIZE                                    0x1
#define _B4D2_B4D25_LENGTH                                  0x1
#define _B4D2_B4D25_MASK                                    0x20
#define _B4D2_B4D26_POSN                                    0x6
#define _B4D2_B4D26_POSITION                                0x6
#define _B4D2_B4D26_SIZE                                    0x1
#define _B4D2_B4D26_LENGTH                                  0x1
#define _B4D2_B4D26_MASK                                    0x40
#define _B4D2_B4D27_POSN                                    0x7
#define _B4D2_B4D27_POSITION                                0x7
#define _B4D2_B4D27_SIZE                                    0x1
#define _B4D2_B4D27_LENGTH                                  0x1
#define _B4D2_B4D27_MASK                                    0x80

// Register: B4D3
#define B4D3 B4D3
extern volatile unsigned char           B4D3                __at(0xE69);
#ifndef _LIB_BUILD
asm("B4D3 equ 0E69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D30                  :1;
        unsigned B4D31                  :1;
        unsigned B4D32                  :1;
        unsigned B4D33                  :1;
        unsigned B4D34                  :1;
        unsigned B4D35                  :1;
        unsigned B4D36                  :1;
        unsigned B4D37                  :1;
    };
} B4D3bits_t;
