MikroElektronika/core_packages/PIC/XC8/def/PIC18F4682/mcu.h
// Register: RXF1SIDH
#define RXF1SIDH RXF1SIDH
extern volatile unsigned char           RXF1SIDH            __at(0xF04);
#ifndef _LIB_BUILD
asm("RXF1SIDH equ 0F04h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF1SID3               :1;
        unsigned RXF1SID4               :1;
        unsigned RXF1SID5               :1;
        unsigned RXF1SID6               :1;
        unsigned RXF1SID7               :1;
        unsigned RXF1SID8               :1;
        unsigned RXF1SID9               :1;
        unsigned RXF1SID10              :1;
    };
} RXF1SIDHbits_t;
extern volatile RXF1SIDHbits_t RXF1SIDHbits __at(0xF04);
// bitfield macros
#define _RXF1SIDH_SID3_POSN                                 0x0
#define _RXF1SIDH_SID3_POSITION                             0x0
#define _RXF1SIDH_SID3_SIZE                                 0x1
#define _RXF1SIDH_SID3_LENGTH                               0x1
#define _RXF1SIDH_SID3_MASK                                 0x1
#define _RXF1SIDH_SID4_POSN                                 0x1
#define _RXF1SIDH_SID4_POSITION                             0x1
#define _RXF1SIDH_SID4_SIZE                                 0x1
#define _RXF1SIDH_SID4_LENGTH                               0x1
#define _RXF1SIDH_SID4_MASK                                 0x2
#define _RXF1SIDH_SID5_POSN                                 0x2
#define _RXF1SIDH_SID5_POSITION                             0x2
#define _RXF1SIDH_SID5_SIZE                                 0x1
#define _RXF1SIDH_SID5_LENGTH                               0x1
#define _RXF1SIDH_SID5_MASK                                 0x4
#define _RXF1SIDH_SID6_POSN                                 0x3
#define _RXF1SIDH_SID6_POSITION                             0x3
#define _RXF1SIDH_SID6_SIZE                                 0x1
#define _RXF1SIDH_SID6_LENGTH                               0x1
#define _RXF1SIDH_SID6_MASK                                 0x8
#define _RXF1SIDH_SID7_POSN                                 0x4
#define _RXF1SIDH_SID7_POSITION                             0x4
#define _RXF1SIDH_SID7_SIZE                                 0x1
#define _RXF1SIDH_SID7_LENGTH                               0x1
#define _RXF1SIDH_SID7_MASK                                 0x10
#define _RXF1SIDH_SID8_POSN                                 0x5
#define _RXF1SIDH_SID8_POSITION                             0x5
#define _RXF1SIDH_SID8_SIZE                                 0x1
#define _RXF1SIDH_SID8_LENGTH                               0x1
#define _RXF1SIDH_SID8_MASK                                 0x20
#define _RXF1SIDH_SID9_POSN                                 0x6
#define _RXF1SIDH_SID9_POSITION                             0x6
#define _RXF1SIDH_SID9_SIZE                                 0x1
#define _RXF1SIDH_SID9_LENGTH                               0x1
#define _RXF1SIDH_SID9_MASK                                 0x40
#define _RXF1SIDH_SID10_POSN                                0x7
#define _RXF1SIDH_SID10_POSITION                            0x7
#define _RXF1SIDH_SID10_SIZE                                0x1
#define _RXF1SIDH_SID10_LENGTH                              0x1
#define _RXF1SIDH_SID10_MASK                                0x80
#define _RXF1SIDH_RXF1SID3_POSN                             0x0
#define _RXF1SIDH_RXF1SID3_POSITION                         0x0
#define _RXF1SIDH_RXF1SID3_SIZE                             0x1
#define _RXF1SIDH_RXF1SID3_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID3_MASK                             0x1
#define _RXF1SIDH_RXF1SID4_POSN                             0x1
#define _RXF1SIDH_RXF1SID4_POSITION                         0x1
#define _RXF1SIDH_RXF1SID4_SIZE                             0x1
#define _RXF1SIDH_RXF1SID4_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID4_MASK                             0x2
#define _RXF1SIDH_RXF1SID5_POSN                             0x2
#define _RXF1SIDH_RXF1SID5_POSITION                         0x2
#define _RXF1SIDH_RXF1SID5_SIZE                             0x1
#define _RXF1SIDH_RXF1SID5_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID5_MASK                             0x4
#define _RXF1SIDH_RXF1SID6_POSN                             0x3
#define _RXF1SIDH_RXF1SID6_POSITION                         0x3
#define _RXF1SIDH_RXF1SID6_SIZE                             0x1
#define _RXF1SIDH_RXF1SID6_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID6_MASK                             0x8
#define _RXF1SIDH_RXF1SID7_POSN                             0x4
#define _RXF1SIDH_RXF1SID7_POSITION                         0x4
#define _RXF1SIDH_RXF1SID7_SIZE                             0x1
#define _RXF1SIDH_RXF1SID7_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID7_MASK                             0x10
#define _RXF1SIDH_RXF1SID8_POSN                             0x5
#define _RXF1SIDH_RXF1SID8_POSITION                         0x5
#define _RXF1SIDH_RXF1SID8_SIZE                             0x1
#define _RXF1SIDH_RXF1SID8_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID8_MASK                             0x20
#define _RXF1SIDH_RXF1SID9_POSN                             0x6
#define _RXF1SIDH_RXF1SID9_POSITION                         0x6
#define _RXF1SIDH_RXF1SID9_SIZE                             0x1
#define _RXF1SIDH_RXF1SID9_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID9_MASK                             0x40
#define _RXF1SIDH_RXF1SID10_POSN                            0x7
#define _RXF1SIDH_RXF1SID10_POSITION                        0x7
#define _RXF1SIDH_RXF1SID10_SIZE                            0x1
#define _RXF1SIDH_RXF1SID10_LENGTH                          0x1
#define _RXF1SIDH_RXF1SID10_MASK                            0x80

// Register: RXF1SIDL
#define RXF1SIDL RXF1SIDL
extern volatile unsigned char           RXF1SIDL            __at(0xF05);
#ifndef _LIB_BUILD
asm("RXF1SIDL equ 0F05h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF1EID16              :1;
        unsigned RXF1EID17              :1;
        unsigned                        :1;
        unsigned RXF1EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF1SID0               :1;
        unsigned RXF1SID1               :1;
        unsigned RXF1SID2               :1;
    };
} RXF1SIDLbits_t;
extern volatile RXF1SIDLbits_t RXF1SIDLbits __at(0xF05);
// bitfield macros
#define _RXF1SIDL_EID16_POSN                                0x0
#define _RXF1SIDL_EID16_POSITION                            0x0
#define _RXF1SIDL_EID16_SIZE                                0x1
#define _RXF1SIDL_EID16_LENGTH                              0x1
#define _RXF1SIDL_EID16_MASK                                0x1
#define _RXF1SIDL_EID17_POSN                                0x1
#define _RXF1SIDL_EID17_POSITION                            0x1
#define _RXF1SIDL_EID17_SIZE                                0x1
#define _RXF1SIDL_EID17_LENGTH                              0x1
#define _RXF1SIDL_EID17_MASK                                0x2
#define _RXF1SIDL_EXIDEN_POSN                               0x3
#define _RXF1SIDL_EXIDEN_POSITION                           0x3
#define _RXF1SIDL_EXIDEN_SIZE                               0x1
#define _RXF1SIDL_EXIDEN_LENGTH                             0x1
#define _RXF1SIDL_EXIDEN_MASK                               0x8
#define _RXF1SIDL_SID0_POSN                                 0x5
#define _RXF1SIDL_SID0_POSITION                             0x5
#define _RXF1SIDL_SID0_SIZE                                 0x1
#define _RXF1SIDL_SID0_LENGTH                               0x1
#define _RXF1SIDL_SID0_MASK                                 0x20
#define _RXF1SIDL_SID1_POSN                                 0x6
#define _RXF1SIDL_SID1_POSITION                             0x6
#define _RXF1SIDL_SID1_SIZE                                 0x1
#define _RXF1SIDL_SID1_LENGTH                               0x1
#define _RXF1SIDL_SID1_MASK                                 0x40
#define _RXF1SIDL_SID2_POSN                                 0x7
#define _RXF1SIDL_SID2_POSITION                             0x7
#define _RXF1SIDL_SID2_SIZE                                 0x1
#define _RXF1SIDL_SID2_LENGTH                               0x1
#define _RXF1SIDL_SID2_MASK                                 0x80
#define _RXF1SIDL_EXIDE_POSN                                0x3
#define _RXF1SIDL_EXIDE_POSITION                            0x3
#define _RXF1SIDL_EXIDE_SIZE                                0x1
#define _RXF1SIDL_EXIDE_LENGTH                              0x1
#define _RXF1SIDL_EXIDE_MASK                                0x8
#define _RXF1SIDL_RXF1EID16_POSN                            0x0
#define _RXF1SIDL_RXF1EID16_POSITION                        0x0
#define _RXF1SIDL_RXF1EID16_SIZE                            0x1
#define _RXF1SIDL_RXF1EID16_LENGTH                          0x1
#define _RXF1SIDL_RXF1EID16_MASK                            0x1
#define _RXF1SIDL_RXF1EID17_POSN                            0x1
#define _RXF1SIDL_RXF1EID17_POSITION                        0x1
#define _RXF1SIDL_RXF1EID17_SIZE                            0x1
#define _RXF1SIDL_RXF1EID17_LENGTH                          0x1
#define _RXF1SIDL_RXF1EID17_MASK                            0x2
#define _RXF1SIDL_RXF1EXIDEN_POSN                           0x3
#define _RXF1SIDL_RXF1EXIDEN_POSITION                       0x3
#define _RXF1SIDL_RXF1EXIDEN_SIZE                           0x1
#define _RXF1SIDL_RXF1EXIDEN_LENGTH                         0x1
#define _RXF1SIDL_RXF1EXIDEN_MASK                           0x8
#define _RXF1SIDL_RXF1SID0_POSN                             0x5
#define _RXF1SIDL_RXF1SID0_POSITION                         0x5
#define _RXF1SIDL_RXF1SID0_SIZE                             0x1
#define _RXF1SIDL_RXF1SID0_LENGTH                           0x1
#define _RXF1SIDL_RXF1SID0_MASK                             0x20
#define _RXF1SIDL_RXF1SID1_POSN                             0x6
#define _RXF1SIDL_RXF1SID1_POSITION                         0x6
#define _RXF1SIDL_RXF1SID1_SIZE                             0x1
#define _RXF1SIDL_RXF1SID1_LENGTH                           0x1
#define _RXF1SIDL_RXF1SID1_MASK                             0x40
#define _RXF1SIDL_RXF1SID2_POSN                             0x7
#define _RXF1SIDL_RXF1SID2_POSITION                         0x7
#define _RXF1SIDL_RXF1SID2_SIZE                             0x1
#define _RXF1SIDL_RXF1SID2_LENGTH                           0x1
#define _RXF1SIDL_RXF1SID2_MASK                             0x80

// Register: RXF1EIDH
#define RXF1EIDH RXF1EIDH
extern volatile unsigned char           RXF1EIDH            __at(0xF06);
#ifndef _LIB_BUILD
asm("RXF1EIDH equ 0F06h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF1EID8               :1;
        unsigned RXF1EID9               :1;
        unsigned RXF1EID10              :1;
        unsigned RXF1EID11              :1;
        unsigned RXF1EID12              :1;
        unsigned RXF1EID13              :1;
        unsigned RXF1EID14              :1;
        unsigned RXF1EID15              :1;
    };
} RXF1EIDHbits_t;
extern volatile RXF1EIDHbits_t RXF1EIDHbits __at(0xF06);
// bitfield macros
#define _RXF1EIDH_EID8_POSN                                 0x0
#define _RXF1EIDH_EID8_POSITION                             0x0
#define _RXF1EIDH_EID8_SIZE                                 0x1
#define _RXF1EIDH_EID8_LENGTH                               0x1
#define _RXF1EIDH_EID8_MASK                                 0x1
#define _RXF1EIDH_EID9_POSN                                 0x1
#define _RXF1EIDH_EID9_POSITION                             0x1
#define _RXF1EIDH_EID9_SIZE                                 0x1
#define _RXF1EIDH_EID9_LENGTH                               0x1
#define _RXF1EIDH_EID9_MASK                                 0x2
#define _RXF1EIDH_EID10_POSN                                0x2
#define _RXF1EIDH_EID10_POSITION                            0x2
#define _RXF1EIDH_EID10_SIZE                                0x1
#define _RXF1EIDH_EID10_LENGTH                              0x1
#define _RXF1EIDH_EID10_MASK                                0x4
#define _RXF1EIDH_EID11_POSN                                0x3
#define _RXF1EIDH_EID11_POSITION                            0x3
#define _RXF1EIDH_EID11_SIZE                                0x1
#define _RXF1EIDH_EID11_LENGTH                              0x1
#define _RXF1EIDH_EID11_MASK                                0x8
#define _RXF1EIDH_EID12_POSN                                0x4
#define _RXF1EIDH_EID12_POSITION                            0x4
#define _RXF1EIDH_EID12_SIZE                                0x1
#define _RXF1EIDH_EID12_LENGTH                              0x1
#define _RXF1EIDH_EID12_MASK                                0x10
#define _RXF1EIDH_EID13_POSN                                0x5
#define _RXF1EIDH_EID13_POSITION                            0x5
#define _RXF1EIDH_EID13_SIZE                                0x1
#define _RXF1EIDH_EID13_LENGTH                              0x1
#define _RXF1EIDH_EID13_MASK                                0x20
#define _RXF1EIDH_EID14_POSN                                0x6
#define _RXF1EIDH_EID14_POSITION                            0x6
#define _RXF1EIDH_EID14_SIZE                                0x1
#define _RXF1EIDH_EID14_LENGTH                              0x1
#define _RXF1EIDH_EID14_MASK                                0x40
#define _RXF1EIDH_EID15_POSN                                0x7
#define _RXF1EIDH_EID15_POSITION                            0x7
#define _RXF1EIDH_EID15_SIZE                                0x1
#define _RXF1EIDH_EID15_LENGTH                              0x1
#define _RXF1EIDH_EID15_MASK                                0x80
#define _RXF1EIDH_RXF1EID8_POSN                             0x0
#define _RXF1EIDH_RXF1EID8_POSITION                         0x0
#define _RXF1EIDH_RXF1EID8_SIZE                             0x1
#define _RXF1EIDH_RXF1EID8_LENGTH                           0x1
#define _RXF1EIDH_RXF1EID8_MASK                             0x1
#define _RXF1EIDH_RXF1EID9_POSN                             0x1
#define _RXF1EIDH_RXF1EID9_POSITION                         0x1
#define _RXF1EIDH_RXF1EID9_SIZE                             0x1
#define _RXF1EIDH_RXF1EID9_LENGTH                           0x1
#define _RXF1EIDH_RXF1EID9_MASK                             0x2
#define _RXF1EIDH_RXF1EID10_POSN                            0x2
#define _RXF1EIDH_RXF1EID10_POSITION                        0x2
#define _RXF1EIDH_RXF1EID10_SIZE                            0x1
#define _RXF1EIDH_RXF1EID10_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID10_MASK                            0x4
#define _RXF1EIDH_RXF1EID11_POSN                            0x3
#define _RXF1EIDH_RXF1EID11_POSITION                        0x3
#define _RXF1EIDH_RXF1EID11_SIZE                            0x1
#define _RXF1EIDH_RXF1EID11_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID11_MASK                            0x8
#define _RXF1EIDH_RXF1EID12_POSN                            0x4
#define _RXF1EIDH_RXF1EID12_POSITION                        0x4
#define _RXF1EIDH_RXF1EID12_SIZE                            0x1
#define _RXF1EIDH_RXF1EID12_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID12_MASK                            0x10
#define _RXF1EIDH_RXF1EID13_POSN                            0x5
#define _RXF1EIDH_RXF1EID13_POSITION                        0x5
#define _RXF1EIDH_RXF1EID13_SIZE                            0x1
#define _RXF1EIDH_RXF1EID13_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID13_MASK                            0x20
#define _RXF1EIDH_RXF1EID14_POSN                            0x6
#define _RXF1EIDH_RXF1EID14_POSITION                        0x6
#define _RXF1EIDH_RXF1EID14_SIZE                            0x1
#define _RXF1EIDH_RXF1EID14_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID14_MASK                            0x40
#define _RXF1EIDH_RXF1EID15_POSN                            0x7
#define _RXF1EIDH_RXF1EID15_POSITION                        0x7
#define _RXF1EIDH_RXF1EID15_SIZE                            0x1
#define _RXF1EIDH_RXF1EID15_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID15_MASK                            0x80

// Register: RXF1EIDL
#define RXF1EIDL RXF1EIDL
extern volatile unsigned char           RXF1EIDL            __at(0xF07);
#ifndef _LIB_BUILD
asm("RXF1EIDL equ 0F07h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF1EID0               :1;
        unsigned RXF1EID1               :1;
        unsigned RXF1EID2               :1;
        unsigned RXF1EID3               :1;
        unsigned RXF1EID4               :1;
        unsigned RXF1EID5               :1;
        unsigned RXF1EID6               :1;
        unsigned RXF1EID7               :1;
    };
} RXF1EIDLbits_t;
extern volatile RXF1EIDLbits_t RXF1EIDLbits __at(0xF07);
// bitfield macros
#define _RXF1EIDL_EID0_POSN                                 0x0
#define _RXF1EIDL_EID0_POSITION                             0x0
#define _RXF1EIDL_EID0_SIZE                                 0x1
#define _RXF1EIDL_EID0_LENGTH                               0x1
#define _RXF1EIDL_EID0_MASK                                 0x1
#define _RXF1EIDL_EID1_POSN                                 0x1
#define _RXF1EIDL_EID1_POSITION                             0x1
#define _RXF1EIDL_EID1_SIZE                                 0x1
#define _RXF1EIDL_EID1_LENGTH                               0x1
#define _RXF1EIDL_EID1_MASK                                 0x2
#define _RXF1EIDL_EID2_POSN                                 0x2
#define _RXF1EIDL_EID2_POSITION                             0x2
#define _RXF1EIDL_EID2_SIZE                                 0x1
#define _RXF1EIDL_EID2_LENGTH                               0x1
#define _RXF1EIDL_EID2_MASK                                 0x4
#define _RXF1EIDL_EID3_POSN                                 0x3
#define _RXF1EIDL_EID3_POSITION                             0x3
#define _RXF1EIDL_EID3_SIZE                                 0x1
#define _RXF1EIDL_EID3_LENGTH                               0x1
#define _RXF1EIDL_EID3_MASK                                 0x8
#define _RXF1EIDL_EID4_POSN                                 0x4
#define _RXF1EIDL_EID4_POSITION                             0x4
#define _RXF1EIDL_EID4_SIZE                                 0x1
#define _RXF1EIDL_EID4_LENGTH                               0x1
#define _RXF1EIDL_EID4_MASK                                 0x10
#define _RXF1EIDL_EID5_POSN                                 0x5
#define _RXF1EIDL_EID5_POSITION                             0x5
#define _RXF1EIDL_EID5_SIZE                                 0x1
#define _RXF1EIDL_EID5_LENGTH                               0x1
#define _RXF1EIDL_EID5_MASK                                 0x20
#define _RXF1EIDL_EID6_POSN                                 0x6
#define _RXF1EIDL_EID6_POSITION                             0x6
#define _RXF1EIDL_EID6_SIZE                                 0x1
#define _RXF1EIDL_EID6_LENGTH                               0x1
#define _RXF1EIDL_EID6_MASK                                 0x40
#define _RXF1EIDL_EID7_POSN                                 0x7
#define _RXF1EIDL_EID7_POSITION                             0x7
#define _RXF1EIDL_EID7_SIZE                                 0x1
#define _RXF1EIDL_EID7_LENGTH                               0x1
#define _RXF1EIDL_EID7_MASK                                 0x80
#define _RXF1EIDL_RXF1EID0_POSN                             0x0
#define _RXF1EIDL_RXF1EID0_POSITION                         0x0
#define _RXF1EIDL_RXF1EID0_SIZE                             0x1
#define _RXF1EIDL_RXF1EID0_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID0_MASK                             0x1
#define _RXF1EIDL_RXF1EID1_POSN                             0x1
#define _RXF1EIDL_RXF1EID1_POSITION                         0x1
#define _RXF1EIDL_RXF1EID1_SIZE                             0x1
#define _RXF1EIDL_RXF1EID1_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID1_MASK                             0x2
#define _RXF1EIDL_RXF1EID2_POSN                             0x2
#define _RXF1EIDL_RXF1EID2_POSITION                         0x2
#define _RXF1EIDL_RXF1EID2_SIZE                             0x1
#define _RXF1EIDL_RXF1EID2_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID2_MASK                             0x4
#define _RXF1EIDL_RXF1EID3_POSN                             0x3
#define _RXF1EIDL_RXF1EID3_POSITION                         0x3
#define _RXF1EIDL_RXF1EID3_SIZE                             0x1
#define _RXF1EIDL_RXF1EID3_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID3_MASK                             0x8
#define _RXF1EIDL_RXF1EID4_POSN                             0x4
#define _RXF1EIDL_RXF1EID4_POSITION                         0x4
#define _RXF1EIDL_RXF1EID4_SIZE                             0x1
#define _RXF1EIDL_RXF1EID4_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID4_MASK                             0x10
#define _RXF1EIDL_RXF1EID5_POSN                             0x5
#define _RXF1EIDL_RXF1EID5_POSITION                         0x5
#define _RXF1EIDL_RXF1EID5_SIZE                             0x1
#define _RXF1EIDL_RXF1EID5_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID5_MASK                             0x20
#define _RXF1EIDL_RXF1EID6_POSN                             0x6
#define _RXF1EIDL_RXF1EID6_POSITION                         0x6
#define _RXF1EIDL_RXF1EID6_SIZE                             0x1
#define _RXF1EIDL_RXF1EID6_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID6_MASK                             0x40
#define _RXF1EIDL_RXF1EID7_POSN                             0x7
#define _RXF1EIDL_RXF1EID7_POSITION                         0x7
#define _RXF1EIDL_RXF1EID7_SIZE                             0x1
#define _RXF1EIDL_RXF1EID7_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID7_MASK                             0x80

