MikroElektronika/core_packages/PIC/XC8/def/PIC18F4682/mcu.h
// Register: TXB2D1
#define TXB2D1 TXB2D1
extern volatile unsigned char           TXB2D1              __at(0xF27);
#ifndef _LIB_BUILD
asm("TXB2D1 equ 0F27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D10                :1;
        unsigned TXB2D11                :1;
        unsigned TXB2D12                :1;
        unsigned TXB2D13                :1;
        unsigned TXB2D14                :1;
        unsigned TXB2D15                :1;
        unsigned TXB2D16                :1;
        unsigned TXB2D17                :1;
    };
} TXB2D1bits_t;
extern volatile TXB2D1bits_t TXB2D1bits __at(0xF27);
// bitfield macros
#define _TXB2D1_TXB2D10_POSN                                0x0
#define _TXB2D1_TXB2D10_POSITION                            0x0
#define _TXB2D1_TXB2D10_SIZE                                0x1
#define _TXB2D1_TXB2D10_LENGTH                              0x1
#define _TXB2D1_TXB2D10_MASK                                0x1
#define _TXB2D1_TXB2D11_POSN                                0x1
#define _TXB2D1_TXB2D11_POSITION                            0x1
#define _TXB2D1_TXB2D11_SIZE                                0x1
#define _TXB2D1_TXB2D11_LENGTH                              0x1
#define _TXB2D1_TXB2D11_MASK                                0x2
#define _TXB2D1_TXB2D12_POSN                                0x2
#define _TXB2D1_TXB2D12_POSITION                            0x2
#define _TXB2D1_TXB2D12_SIZE                                0x1
#define _TXB2D1_TXB2D12_LENGTH                              0x1
#define _TXB2D1_TXB2D12_MASK                                0x4
#define _TXB2D1_TXB2D13_POSN                                0x3
#define _TXB2D1_TXB2D13_POSITION                            0x3
#define _TXB2D1_TXB2D13_SIZE                                0x1
#define _TXB2D1_TXB2D13_LENGTH                              0x1
#define _TXB2D1_TXB2D13_MASK                                0x8
#define _TXB2D1_TXB2D14_POSN                                0x4
#define _TXB2D1_TXB2D14_POSITION                            0x4
#define _TXB2D1_TXB2D14_SIZE                                0x1
#define _TXB2D1_TXB2D14_LENGTH                              0x1
#define _TXB2D1_TXB2D14_MASK                                0x10
#define _TXB2D1_TXB2D15_POSN                                0x5
#define _TXB2D1_TXB2D15_POSITION                            0x5
#define _TXB2D1_TXB2D15_SIZE                                0x1
#define _TXB2D1_TXB2D15_LENGTH                              0x1
#define _TXB2D1_TXB2D15_MASK                                0x20
#define _TXB2D1_TXB2D16_POSN                                0x6
#define _TXB2D1_TXB2D16_POSITION                            0x6
#define _TXB2D1_TXB2D16_SIZE                                0x1
#define _TXB2D1_TXB2D16_LENGTH                              0x1
#define _TXB2D1_TXB2D16_MASK                                0x40
#define _TXB2D1_TXB2D17_POSN                                0x7
#define _TXB2D1_TXB2D17_POSITION                            0x7
#define _TXB2D1_TXB2D17_SIZE                                0x1
#define _TXB2D1_TXB2D17_LENGTH                              0x1
#define _TXB2D1_TXB2D17_MASK                                0x80

// Register: TXB2D2
#define TXB2D2 TXB2D2
extern volatile unsigned char           TXB2D2              __at(0xF28);
#ifndef _LIB_BUILD
asm("TXB2D2 equ 0F28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D20                :1;
        unsigned TXB2D21                :1;
        unsigned TXB2D22                :1;
        unsigned TXB2D23                :1;
        unsigned TXB2D24                :1;
        unsigned TXB2D25                :1;
        unsigned TXB2D26                :1;
        unsigned TXB2D27                :1;
    };
} TXB2D2bits_t;
extern volatile TXB2D2bits_t TXB2D2bits __at(0xF28);
// bitfield macros
#define _TXB2D2_TXB2D20_POSN                                0x0
#define _TXB2D2_TXB2D20_POSITION                            0x0
#define _TXB2D2_TXB2D20_SIZE                                0x1
#define _TXB2D2_TXB2D20_LENGTH                              0x1
#define _TXB2D2_TXB2D20_MASK                                0x1
#define _TXB2D2_TXB2D21_POSN                                0x1
#define _TXB2D2_TXB2D21_POSITION                            0x1
#define _TXB2D2_TXB2D21_SIZE                                0x1
#define _TXB2D2_TXB2D21_LENGTH                              0x1
#define _TXB2D2_TXB2D21_MASK                                0x2
#define _TXB2D2_TXB2D22_POSN                                0x2
#define _TXB2D2_TXB2D22_POSITION                            0x2
#define _TXB2D2_TXB2D22_SIZE                                0x1
#define _TXB2D2_TXB2D22_LENGTH                              0x1
#define _TXB2D2_TXB2D22_MASK                                0x4
#define _TXB2D2_TXB2D23_POSN                                0x3
#define _TXB2D2_TXB2D23_POSITION                            0x3
#define _TXB2D2_TXB2D23_SIZE                                0x1
#define _TXB2D2_TXB2D23_LENGTH                              0x1
#define _TXB2D2_TXB2D23_MASK                                0x8
#define _TXB2D2_TXB2D24_POSN                                0x4
#define _TXB2D2_TXB2D24_POSITION                            0x4
#define _TXB2D2_TXB2D24_SIZE                                0x1
#define _TXB2D2_TXB2D24_LENGTH                              0x1
#define _TXB2D2_TXB2D24_MASK                                0x10
#define _TXB2D2_TXB2D25_POSN                                0x5
#define _TXB2D2_TXB2D25_POSITION                            0x5
#define _TXB2D2_TXB2D25_SIZE                                0x1
#define _TXB2D2_TXB2D25_LENGTH                              0x1
#define _TXB2D2_TXB2D25_MASK                                0x20
#define _TXB2D2_TXB2D26_POSN                                0x6
#define _TXB2D2_TXB2D26_POSITION                            0x6
#define _TXB2D2_TXB2D26_SIZE                                0x1
#define _TXB2D2_TXB2D26_LENGTH                              0x1
#define _TXB2D2_TXB2D26_MASK                                0x40
#define _TXB2D2_TXB2D27_POSN                                0x7
#define _TXB2D2_TXB2D27_POSITION                            0x7
#define _TXB2D2_TXB2D27_SIZE                                0x1
#define _TXB2D2_TXB2D27_LENGTH                              0x1
#define _TXB2D2_TXB2D27_MASK                                0x80

